app/views/users/home.html.erb

SELECT "events".* FROM "events"
---
  </ul>
<% current_user.events.each do |event| %>