app/views/events/show.html.erb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."event_id" = ? LIMIT 1  [["event_id", 5]]
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ?  [["playlist_id", 1]]
---

<% @event.playlist.songs.each do |song| %>