app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "event_guests" ("event_id", "guest_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 11], ["guest_id", 13], ["created_at", "2016-09-23 16:35:16.757859"], ["updated_at", "2016-09-23 16:35:16.757859"]]
---
  def guest
    event = Event.find(params[:id])
    current_user
    if event.guests.include?(@current_user)
      redirect_to event_path(event)
    else
      event.guests << @current_user