app/controllers/events_controller.rb

INSERT INTO "events" ("name", "date", "host_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Big Ass Party"], ["date", "2018-12-12"], ["host_id", 7], ["created_at", "2016-09-22 15:54:33.853219"], ["updated_at", "2016-09-22 15:54:33.853219"]]
INSERT INTO "playlists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-10-12 01:30:22.869092"], ["updated_at", "2016-10-12 01:30:22.869092"]]
UPDATE "events" SET "playlist" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["playlist", "http://open.spotify.com/user/1237346371/playlist/6ZyO9vWdJ37rgQEVFSI5NP"], ["updated_at", "2016-09-22 20:58:02.833742"], ["id", 18]]
UPDATE "playlists" SET "event_id" = ?, "host_id" = ?, "spotify_playlist_id" = ?, "spotify_url" = ?, "rsvp_url" = ?, "updated_at" = ? WHERE "playlists"."id" = ?
---
  def create
    @event = Event.create(event_params(:name, :date, :host_id))
    # @event.guests << current_user
    @event.create_playlist
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "0001-11-01"], ["updated_at", "2016-09-26 20:56:10.773069"], ["id", 1]]
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params(:date))

SELECT "events".* FROM "events"
---
  def index
    if !current_user
      redirect_to new_user_path
    end
    @event = Event.new
    @events = current_user.events.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 13]]
INSERT INTO "event_guests" ("event_id", "guest_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 13], ["guest_id", 1], ["created_at", "2016-10-12 21:43:22.779863"], ["updated_at", "2016-10-12 21:43:22.779863"]]
---
  def rsvp
    event = Event.find(params[:id])
    current_user
    if event.guests.include?(@current_user)
      redirect_to event_path(event)
    else
      event.guests << @current_user

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 23]]
---
  def guests
    event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 23]]
---
  def playlist
    event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
---
  def refresh_playlist
    event = Event.find(params[:id])