app/controllers/events_controller.rb

INSERT INTO "event_guests" ("event_id", "guest_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 7], ["guest_id", 7], ["created_at", "2016-09-22 17:09:12.190324"], ["updated_at", "2016-09-22 17:09:12.190324"]]
INSERT INTO "users" ("id","uid","display_name","password_digest","email","top_tracks","top_artists","created_at","updated_at") VALUES (1, 1, NULL, NULL, NULL, NULL, NULL, '2016-09-21 21:24:47.658859', '2016-09-21 21:24:47.658859')
---
  def create
    @event = Event.new(event_params(:name, :date, :host_id))
    @event.guests = [current_user]
    @event.create_playlist