app/controllers/songs_controller.rb

  def create
    @song = Song.create(song_params)
---
INSERT INTO "songs" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 11], ["name", "right as rain"], ["created_at", "2016-09-26 16:39:35.293300"], ["updated_at", "2016-09-26 16:39:35.293300"]]