app/controllers/users_controller.rb

INSERT INTO "users" ("uid", "created_at", "updated_at") VALUES (?, ?, ?)  [["uid", 1237346371], ["created_at", "2016-09-21 21:40:45.191327"], ["updated_at", "2016-09-21 21:40:45.191327"]]
---
  def spotify
    spotify_user = RSpotify::User.new(request.env['omniauth.auth'])
    user = UserAdapter.create(spotify_user)

INSERT INTO "users" ("display_name", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "top_tracks" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["top_tracks", "---\n- 4CpKEkdGbOJV51cSvx7SoG\n- 2Q2SougPFYpLWVZVx1dRNK\n- 77Jo0LLt7KmCshe4WOazYx\n"], ["updated_at", "2016-09-23 18:53:22.194441"], ["id", 15]]
---
  def create
    @user = User.create(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."display_name" = ? LIMIT 1  [["display_name", "asdf"]]
---
  def login
    return redirect_to root_path, notice: "Cannot find username #{params[:user][:display_name]}" unless @user = User.find_by(display_name: params[:user][:display_name])