app/controllers/users_controller.rb

SELECT "events".* FROM "events"
---
  def home
    current_user
    @event = Event.new
    @events = Event.all